Internet Engineering Task Force                            A. Kuzmanovic
INTERNET-DRAFT                                                 A. Mondal
Intended status: Proposed Standard               Northwestern University
Expires: 22 February 2009                                       S. Floyd
Updates: 3168                                                       ICIR
                                                       K.K. Ramakrishnan
                                                                    AT&T
                                                          22 August 2008


        Adding Explicit Congestion Notification (ECN) Capability
                        to TCP's SYN/ACK Packets
                     draft-ietf-tcpm-ecnsyn-06.txt


Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on August 2008.

Copyright Notice

   Copyright (C) The IETF Trust (2008).





Floyd et al.            Expires: 22 February 2009               [Page 1]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


Abstract

   This draft specifies a modification to RFC 3168 to allow TCP SYN/ACK
   packets to be ECN-Capable.  For TCP, RFC 3168 only specifies setting
   an ECN-Capable codepoint on data packets, and not on SYN and SYN/ACK
   packets.  However, because of the high cost to the TCP transfer of
   having a SYN/ACK packet dropped, with the resulting retransmit
   timeout, this document specifies the use of ECN for the SYN/ACK
   packet itself, when sent in response to a SYN packet with the two ECN
   flags set in the TCP header, indicating a willingness to use ECN.
   Setting TCP SYN/ACK packets as ECN-Capable can be of great benefit to
   the TCP connection, avoiding the severe penalty of a retransmit
   timeout for a connection that has not yet started placing a load on
   the network.  The sender of the SYN/ACK packet must respond to a
   report of an ECN-marked SYN/ACK packet by reducing its initial
   congestion window from two, three, or four segments to one segment,
   thereby reducing the subsequent load from that connection on the
   network.  This document updates RFC 3168.

Table of Contents

   1. Introduction ....................................................5
   2. Conventions and Terminology .....................................6
   3. Specification ...................................................7
      3.1. SYN/ACK Packets Dropped in the Network .....................7
      3.2. SYN/ACK Packets ECN-Marked in the Network ..................8
      3.3. Management Interface ......................................10
   4. Discussion .....................................................10
      4.1. Flooding Attacks ..........................................10
      4.2. The TCP SYN Packet ........................................11
      4.3. SYN/ACK Packets and Packet Size ...........................11
      4.4. Response to ECN-marking of SYN/ACK Packets ................12
   5. Related Work ...................................................13
   6. Performance Evaluation .........................................14
      6.1. The Costs and Benefit of Adding ECN-Capability ............14
      6.2. An Evaluation of Different Responses to ECN-Marked SYN/ACK
      Packets ........................................................15
   7. Security Considerations ........................................16
      7.1. 'Bad' Routers or Middleboxes ..............................16
      7.2. Congestion Collapse .......................................16
   8. Conclusions ....................................................17
   9. Acknowledgements ...............................................18
   A. Report on Simulations ..........................................18
      A.1. Simulations with RED in Packet Mode .......................19
      A.2. Simulations with RED in Byte Mode .........................21
   B. Issues of Incremental Deployment ...............................23
   Normative References ..............................................26
   Informative References ............................................26



Floyd et al.            Expires: 22 February 2009               [Page 2]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   IANA Considerations ...............................................27
   Full Copyright Statement ..........................................28
   Intellectual Property .............................................28


   NOTE TO RFC EDITOR: PLEASE DELETE THIS NOTE UPON PUBLICATION.

   Changes from draft-ietf-tcpm-ecnsyn-05:

   * Added "Updates: 3168" to the header.  Added a reference
     to RFC 4987.  Mild editing.
     Feedback from Lars's Area Director review.

   * Updated simulation results with new simulation scripts that
     don't require any modifications to the ns simulator, and that
     all use the same seed for generating traffic.  The results are
     somewhat different for the very-high-congestion scenarios
     (with loss rates of 25% in the absence of ECN-capability
     for SYN/ACK packets).  This is reflected in the simulations with
     a target load of 125% in Tables 1 and 2.

   * Added the URL for the web page that has the simulation scripts.

   Changes from draft-ietf-tcpm-ecnsyn-04:

   * Updating the copyright date.

   Changes from draft-ietf-tcpm-ecnsyn-03:

   * General editing.  This includes using the terms "initiator"
     and "responder" for the two ends of the TCP connection.
     Feedback from Alfred Hoenes.

   * Added some text to the backwards compatibility discussion,
     now in Appendix B, about the pros and cons of using a TCP
     flag for the TCP initiator to signal that it understands
     ECN-Capable SYN/ACK packets.  The consensus at this time is
     not to use such a flag.  Also added a recommendation that
     TCP implementations include a management interface to turn
     off the use of ECN for SYN/ACK packets.  From email from
     Bob Briscoe.

   Changes from draft-ietf-tcpm-ecnsyn-02:

   * Added to the discussion in the Security section of whether
     ECN-Capable TCP SYN packets have problems with firewalls,
     over and above the known problems of TCP data packets
     (e.g., as in the Microsoft report).  From a question raised



Floyd et al.            Expires: 22 February 2009               [Page 3]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


     at the TCPM meeting at the July 2007 IETF.

   * Added a sentence to the discussion of routers or middleboxes that
     *might* drop TCP SYN packets on the basis of IP header fields.
     Feedback from Remi Denis-Courmont.

   * General editing.  Feedback from Alfred Hoenes.

   Changes from draft-ietf-tcpm-ecnsyn-01:

   * Changes in response to feedback from Anil Agarwal.

   * Added a look at the costs of adding ECN-Capability to
     SYN/ACKs in a highly-congested scenario.
     From feedback from Mark Allman and Janardhan Iyengar.

   * Added a comparative evaluation of two possible responses
     to an ECN-marked SYN/ACK packet.  From Mark Allman.

   Changes from draft-ietf-tcpm-ecnsyn-00:

   * Only updating the revision number.

   Changes from draft-ietf-twvsg-ecnsyn-00:

   * Changed name of draft to draft-ietf-tcpm-ecnsyn.

   * Added a discussion in Section 3 of "Response to
     ECN-marking of SYN/ACK packets".  Based on
     suggestions from Mark Allman.

   * Added a discussion to the Conclusions about adding
     ECN-capability to relevant set-up packets in other
     protocols.  From a suggestion from Wesley Eddy.

   * Added a description of SYN exchanges with SYN cookies.
     From a suggestion from Wesley Eddy.

   * Added a discussion of one-way data transfers, where the
     host sending the SYN/ACK packet sends no data packets.

   * Minor editing, from feedback from Mark Allman and Janardhan
     Iyengar.

   * Future work: a look at the costs of adding
     ECN-Capability in a worst-case scenario.
     From feedback from Mark Allman and Janardhan Iyengar.




Floyd et al.            Expires: 22 February 2009               [Page 4]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   * Future work: a comparative evaluation of two
     possible responses to an ECN-marked SYN/ACK packet.

   Changes from draft-kuzmanovic-ecn-syn-00.txt:

   * Changed name of draft to draft-ietf-twvsg-ecnsyn.

   END OF NOTE TO RFC EDITOR.

1.  Introduction

   TCP's congestion control mechanism has primarily used packet loss as
   the congestion indication, with packets dropped when buffers
   overflow.  With such tail-drop mechanisms, the packet delay can be
   high, as the queue at bottleneck routers can be fairly large.
   Dropping packets only when the queue overflows, and having TCP react
   only to such losses, results in:
   1) significantly higher packet delay;
   2) unnecessarily many packet losses; and
   3) unfairness due to synchronization effects.

   The adoption of Active Queue Management (AQM) mechanisms allows
   better control of bottleneck queues [RFC2309].  This use of AQM has
   the following potential benefits:
   1) better control of the queue, with reduced queueing delay;
   2) fewer packet drops; and
   3) better fairness because of fewer synchronization effects.

   With the adoption of ECN, performance may be further improved.  When
   the router detects congestion before buffer overflow, the router can
   provide a congestion indication either by dropping a packet, or by
   setting the Congestion Experienced (CE) codepoint in the  Explicit
   Congestion Notification (ECN) field in the IP header [RFC3168].  The
   IETF has standardized the use of the Congestion Experienced (CE)
   codepoint in the IP header for routers to indicate congestion.  For
   incremental deployment and backwards compatibility, the RFC on ECN
   [RFC3168] specifies that routers may mark ECN-capable packets that
   would otherwise have been dropped, using the Congestion Experienced
   codepoint in the ECN field.  The use of ECN allows TCP to react to
   congestion while avoiding unnecessary retransmissions and, in some
   cases, unnecessary retransmit timeouts.  Thus, using ECN has several
   benefits:

   1) For short transfers, a TCP connection's congestion window may be
   small.  For example, if the current window contains only one packet,
   and that packet is dropped, TCP will have to wait for a retransmit
   timeout to recover, reducing its overall throughput.  Similarly, if
   the current window contains only a few packets and one of those



Floyd et al.            Expires: 22 February 2009               [Page 5]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   packets is dropped, there might not be enough duplicate
   acknowledgements for a fast retransmission, and the sender of the
   data packet might have to wait for a delay of several round-trip
   times using Limited Transmit [RFC3042].  With the use of ECN, short
   flows are less likely to have packets dropped, sometimes avoiding
   unnecessary delays or costly retransmit timeouts.

   2) While longer flows may not see substantially improved throughput
   with the use of ECN, they experience lower loss. This may benefit TCP
   applications that are latency- and loss-sensitive, because of the
   avoidance of retransmissions.

   RFC 3168 only specifies marking the Congestion Experienced codepoint
   on TCP's data packets, and not on SYN and SYN/ACK packets.  RFC 3168
   specifies the negotiation of the use of ECN between the two TCP end-
   points in the TCP SYN and SYN-ACK exchange, using flags in the TCP
   header.  Erring on the side of being conservative, RFC 3168 does not
   specify the use of ECN for the SYN/ACK packet itself.  However,
   because of the high cost to the TCP transfer of having a SYN/ACK
   packet dropped, with the resulting retransmit timeout, this document
   specifies the use of ECN for the SYN/ACK packet itself.  This can be
   of great benefit to the TCP connection, avoiding the severe penalty
   of a retransmit timeout for a connection that has not yet started
   placing a load on the network.  The sender of the SYN/ACK packet must
   respond to a report of an ECN-marked SYN/ACK packet by reducing its
   initial congestion window from two, three, or four segments to one
   segment, reducing the subsequent load from that connection on the
   network.

   The use of ECN for SYN/ACK packets has the following potential
   benefits:
   1) Avoidance of a retransmit timeout;
   2) Improvement in the throughput of short connections.

   This draft specifies ECN+, a modification to RFC 3168 to allow TCP
   SYN/ACK packets to be ECN-Capable.  Section 3 contains the
   specification of the change, while Section 4 discusses some of the
   issues, and Section 5 discusses related work.  Section 6 contains an
   evaluation of the specified change.

2.  Conventions and Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC 2119].

   We use the following terminology from RFC 3168:




Floyd et al.            Expires: 22 February 2009               [Page 6]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   The ECN field in the IP header:
   o  CE: the Congestion Experienced codepoint; and
   o  ECT: either one of the two ECN-Capable Transport codepoints.

   The ECN flags in the TCP header:
   o  CWR: the Congestion Window Reduced flag; and
   o  ECE: the ECN-Echo flag.

   ECN-setup packets:
   o  ECN-setup SYN packet: a SYN packet with the ECE and CWR flags;
   o  ECN-setup SYN-ACK packet: a SYN-ACK packet with ECE but not CWR.

   In this document we use the terms "initiator" and "responder" to
   refer to the sender of the SYN packet and of the SYN-ACK packet,
   respectively.

3.  Specification

   This section specifies the modification to RFC 3168 to allow TCP
   SYN/ACK packets to be ECN-Capable.

   RFC 3168 in Section 6.1.1. states that "A host MUST NOT set ECT on
   SYN or SYN-ACK packets." In this section, we specify that a TCP node
   MAY respond to an ECN-setup SYN packet by setting ECT in the
   responding ECN-setup SYN/ACK packet, indicating to routers that the
   SYN/ACK packet is ECN-Capable.  This allows a congested router along
   the path to mark the packet instead of dropping the packet as an
   indication of congestion.

   Assume that TCP node A transmits to TCP node B an ECN-setup SYN
   packet, indicating willingness to use ECN for this connection.  As
   specified by RFC 3168, if TCP node B is willing to use ECN, node B
   responds with an ECN-setup SYN-ACK packet.


3.1.  SYN/ACK Packets Dropped in the Network

   Figure 1 shows an interchange with the SYN/ACK packet dropped by a
   congested router.  Node B waits for a retransmit timeout, and then
   retransmits the SYN/ACK packet.











Floyd et al.            Expires: 22 February 2009               [Page 7]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


        ---------------------------------------------------------------
           TCP Node A             Router                  TCP Node B
           ----------             ------                  ----------

           ECN-setup SYN packet --->
                                            ECN-setup SYN packet --->

                                 <--- ECN-setup SYN/ACK, possibly ECT
                                                   3-second timer set
                               SYN/ACK dropped               .
                                                             .
                                                             .
                                               3-second timer expires
                                      <--- ECN-setup SYN/ACK, not ECT
           <--- ECN-setup SYN/ACK
           Data/ACK --->
                                                        Data/ACK --->
                                     <--- Data (one to four segments)
        ---------------------------------------------------------------

           Figure 1: SYN exchange with the SYN/ACK packet dropped.


   If the SYN/ACK packet is dropped in the network, the responder (node
   B) responds by waiting three seconds for the retransmit timer to
   expire [RFC2988].  If a SYN/ACK packet with the ECT codepoint is
   dropped, the responder SHOULD resend the SYN/ACK packet without the
   ECN-Capable codepoint.  (Although we are not aware of any middleboxes
   that drop SYN/ACK packets that contain an ECN-Capable codepoint in
   the IP header, we have learned to design our protocols defensively in
   this regard [RFC3360].)

   We note that if syn-cookies were used by the responder (node B) in
   the exchange in Figure 1, the responder wouldn't set a timer upon
   transmission of the SYN/ACK packet [SYN-COOK] [RFC4987].  In this
   case, if the SYN/ACK packet was lost, the initiator (Node A) would
   have to timeout and retransmit the SYN packet in order to trigger
   another SYN-ACK.


3.2.  SYN/ACK Packets ECN-Marked in the Network

   Figure 2 shows an interchange with the SYN/ACK packet sent as ECN-
   Capable, and ECN-marked instead of dropped at the congested router.







Floyd et al.            Expires: 22 February 2009               [Page 8]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


        ---------------------------------------------------------------
           TCP Node A             Router                  TCP Node B
           ----------             ------                  ----------

           ECN-setup SYN packet --->
                                           ECN-setup SYN packet --->

                                         <--- ECN-setup SYN/ACK, ECT
                              <--- Sets CE on SYN/ACK
           <--- ECN-setup SYN/ACK, CE

           Data/ACK, ECN-Echo --->
                                             Data/ACK, ECN-Echo --->
                                      Window reduced to one segment.
                                   <--- Data, CWR (one segment only)
        ---------------------------------------------------------------

           Figure 2: SYN exchange with the SYN/ACK packet marked.


   If the initiator (node A) receives a SYN/ACK packet that has been
   marked by the congested router, with the CE codepoint set, the
   initiator MUST respond by setting the ECN-Echo flag in the TCP header
   of the responding ACK packet.  As specified in RFC 3168, the
   initiator continues to set the ECN-Echo flag in packets until it
   receives a packet with the CWR flag set.

   When the responder (node B) receives the ECN-Echo packet reporting
   the Congestion Experienced indication in the SYN/ACK packet, the
   responder MUST set the initial congestion window to one segment,
   instead of two segments as allowed by [RFC2581], or three or four
   segments allowed by [RFC3390].  If the responder (node B) was going
   to use an initial window of one segment, and receives an ECN-Echo
   packet informing it of a Congestion Experienced indication on its
   SYN/ACK packet, the responder MAY continue to send with an initial
   window of one segment, without waiting for a retransmit timeout.  We
   note that this updates RFC 3168, which specifies that "the sending
   TCP MUST reset the retransmit timer on receiving the ECN-Echo packet
   when the congestion window is one."  As specified by RFC 3168, the
   responder (node B) also sets the CWR flag in the TCP header of the
   next data packet sent, to acknowledge its receipt of and reaction to
   the ECN-Echo flag.

   If the data transfer in Figure 2 is entirely from Node A to Node B,
   then data packets from Node A continue to set the ECN-Echo flag in
   data packets, waiting for the CWR flag from Node B acknowledging a
   response to the ECN-Echo flag.




Floyd et al.            Expires: 22 February 2009               [Page 9]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


3.3.  Management Interface

   The TCP implementation using ECN-Capable SYN/ACK packets SHOULD
   include a management interface to allow the use of ECN to be turned
   off for SYN/ACK packets.  This is to deal with possible backwards
   compatibility problems such as those discussed in Appendix B.


4.  Discussion


   The rationale for the specification in this document is the
   following.  When node B receives a TCP SYN packet with ECN-Echo bit
   set in the TCP header, this indicates that node A is ECN-capable. If
   node B is also ECN-capable, there are no obstacles to immediately
   setting one of the ECN-Capable codepoints in the IP header in the
   responding TCP SYN/ACK packet.

   There can be a great benefit in setting an ECN-capable codepoint in
   SYN/ACK packets, as is discussed further in [ECN+], and reported
   briefly in Section 5 below.  Congestion is most likely to occur in
   the server-to-client direction.  As a result, setting an ECN-capable
   codepoint in SYN/ACK packets can reduce the occurrence of three-
   second retransmit timeouts resulting from the drop of SYN/ACK
   packets.


4.1.  Flooding Attacks

   Setting an ECN-Capable codepoint in the responding TCP SYN/ACK
   packets does not raise any novel security vulnerabilities.  For
   example, provoking servers or hosts to send SYN/ACK packets to a
   third party in order to perform a "SYN/ACK flood" attack would be
   highly inefficient.  Third parties would immediately drop such
   packets, since they would know that they didn't generate the TCP SYN
   packets in the first place.  Moreover, such SYN/ACK attacks would
   have the same signatures as the existing TCP SYN attacks. Provoking
   servers or hosts to reply with SYN/ACK packets in order to congest a
   certain link would also be highly inefficient because SYN/ACK packets
   are small in size.

   However, the addition of ECN-Capability to SYN/ACK packets could
   allow SYN/ACK packets to persist for more hops along a network path
   before being dropped, thus adding somewhat to the ability of a
   SYN/ACK attack to flood a network link.






Floyd et al.            Expires: 22 February 2009              [Page 10]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


4.2.  The TCP SYN Packet

   There are several reasons why an ECN-Capable codepoint MUST NOT be
   set in the IP header of the initiating TCP SYN packet.  First, when
   the TCP SYN packet is sent, there are no guarantees that the other
   TCP endpoint (node B in Figure 2) is ECN-capable, or that it would be
   able to understand and react if the ECN CE codepoint was set by a
   congested router.

   Second, the ECN-Capable codepoint in TCP SYN packets could be misused
   by malicious clients to `improve' the well-known TCP SYN attack. By
   setting an ECN-Capable codepoint in TCP SYN packets, a malicious host
   might be able to inject a large number of TCP SYN packets through a
   potentially congested ECN-enabled router, congesting it even further.

   For both these reasons, we continue the restriction that the TCP SYN
   packet MUST NOT have the ECN-Capable codepoint in the IP header set.


4.3.  SYN/ACK Packets and Packet Size

   There are a number of router buffer architectures that have smaller
   dropping rates for small (SYN) packets than for large (data) packets.
   For example, for a Drop Tail queue in units of packets, where each
   packet takes a single slot in the buffer regardless of packet size,
   small and large packets are equally likely to be dropped.  However,
   for a Drop Tail queue in units of bytes, small packets are less
   likely to be dropped than are large ones.  Similarly, for RED in
   packet mode, small and large packets are equally likely to be dropped
   or marked, while for RED in byte mode, a packet's chance of being
   dropped or marked is proportional to the packet size in bytes.

   For a congested router with an AQM mechanism in byte mode, where a
   packet's chance of being dropped or marked is proportional to the
   packet size in bytes, the drop or marking rate for TCP SYN/ACK
   packets should generally be low.  In this case, the benefit of making
   SYN/ACK packets ECN-Capable should be similarly moderate.  However,
   for a congested router with a Drop Tail queue in units of packets or
   with an AQM mechanism in packet mode, and with no priority queueing
   for smaller packets, small and large packets should have the same
   probability of being dropped or marked.  In such a case, making
   SYN/ACK packets ECN-Capable should be of significant benefit.

   We believe that there are a wide range of behaviors in the real world
   in terms of the drop or mark behavior at routers as a function of
   packet size [Tools] (Section 10).  We note that all of these
   alternatives listed above are available in the NS simulator (Drop
   Tail queues are by default in units of packets, while the default for



Floyd et al.            Expires: 22 February 2009              [Page 11]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   RED queue management has been changed from packet mode to byte mode).


4.4.  Response to ECN-marking of SYN/ACK Packets

   One question is why TCP SYN/ACK packets should be treated differently
   from other packets in terms of the end node's response to an ECN-
   marked packet.  Section 5 of RFC 3168 specifies the following:

   "Upon the receipt by an ECN-Capable transport of a single CE packet,
   the congestion control algorithms followed at the end-systems MUST be
   essentially the same as the congestion control response to a *single*
   dropped packet.  For example, for ECN-Capable TCP the source TCP is
   required to halve its congestion window for any window of data
   containing either a packet drop or an ECN indication."

   In particular, Section 6.1.2 of RFC 3168 specifies that when the TCP
   congestion window consists of a single packet and that packet is ECN-
   marked in the network, then the data sender must reduce the sending
   rate below one packet per round-trip time, by waiting for one RTO
   before sending another packet.  If the RTO was set to the average
   round-trip time, this would result in halving the sending rate;
   because the RTO is in fact larger than the average round-trip time,
   the sending rate is reduced to less than half of its previous value.

   TCP's congestion control response to the *dropping* of a SYN/ACK
   packet is to wait a default time before sending another packet.  This
   document argues that ECN gives end-systems a wider range of possible
   responses to the *marking* of a SYN/ACK packet, and that waiting a
   default time before sending a data packet is not the desired
   response.

   On the conservative end, one could assume an effective congestion
   window of one packet for the SYN/ACK packet, and respond to an ECN-
   marked SYN/ACK packet by reducing the sending rate to one packet
   every two round-trip times.  As an approximation, the TCP end-node
   could measure the round-trip time T between the sending of the
   SYN/ACK packet and the receipt of the acknowledgement, and reply to
   the acknowledgement of the ECN-marked SYN/ACK packet by waiting T
   seconds before sending a data packet.

   However, we note that for an ECN-marked SYN/ACK packet, halving the
   *congestion window* is not the same as halving the *sending rate*;
   there is no `sending rate' associated with an ECN-Capable SYN/ACK
   packet, as such packets are only sent as the first packet in a
   connection from that host.  Further, a router's marking of a SYN/ACK
   packet is not affected by any past history of that connection.




Floyd et al.            Expires: 22 February 2009              [Page 12]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   Adding ECN-Capability to SYN/ACK packets allows the simple response
   of the responder setting the initial congestion window to one packet,
   instead of its allowed default value of two, three, or four packets,
   with the responder proceeding with a cautious sending rate of one
   packet per round-trip time.  If that data packet is ECN-marked or
   dropped, then the responder will wait an RTO before sending another
   packet.  This document argues that this approach is useful to users,
   with no dangers of congestion collapse or of starvation of competing
   traffic.  This is discussed in more detail below in Section 6.2.  In
   particular, Section 6.2 discusses simulation results that support the
   responder's specified behavior of setting the initial congestion
   window to one packet in response to an ECN-marked SYN/ACK packet.

   We note that if the data transfer is entirely from Node A to Node B,
   then there is no effective difference between the two possible
   responses to an ECN-marked SYN/ACK packet outlined above.  In either
   case, Node B sends no data packets, only sending acknowledgement
   packets in response to received data packets.

5.  Related Work

   The addition of ECN-capability to TCP's SYN/ACK packets was proposed
   in [ECN+].  The paper includes an extensive set of simulation and
   testbed experiments to evaluate the effects of the proposal, using
   several Active Queue Management (AQM) mechanisms, including Random
   Early Detection (RED) [RED], Random Exponential Marking (REM) [REM],
   and Proportional Integrator (PI) [PI].  The performance measures were
   the end-to-end response times for each request/response pair, and the
   aggregate throughput on the bottleneck link.  The end-to-end response
   time was computed as the time from the moment when the request for
   the file is sent to the server, until that file is successfully
   downloaded by the client.

   The measurements from [ECN+] show that setting an ECN-Capable
   codepoint in the IP packet header in TCP SYN/ACK packets
   systematically improves performance with all evaluated AQM schemes.
   When SYN/ACK packets at a congested router are ECN-marked instead of
   dropped, this can avoid a long initial retransmit timeout, improving
   the response time for the affected flow dramatically.

   [ECN+] shows that the impact on aggregate throughput can also be
   quite significant, because marking SYN ACK packets can prevent larger
   flows from suffering long timeouts before being "admitted" into the
   network.  In addition, the testbed measurements from [ECN+] show that
   web servers setting the ECN-Capable codepoint in TCP SYN/ACK packets
   could serve more requests.

   As a final step, [ECN+] explores the co-existence of flows that do



Floyd et al.            Expires: 22 February 2009              [Page 13]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   and don't set the ECN-capable codepoint in TCP SYN/ACK packets.  The
   results in [ECN+] show that both types of flows can coexist, with
   some performance degradation for flows that don't use ECN+.  Flows
   that do use ECN+ improve their end-to-end performance.  At the same
   time, the performance degradation for flows that don't use ECN+, as a
   result of the flows that do use ECN+, increases as a greater fraction
   of flows use ECN+.

6.  Performance Evaluation

6.1.  The Costs and Benefit of Adding ECN-Capability

   [ECN+] explores the costs and benefits of adding ECN-Capability to
   SYN/ACK packets with both simulations and experiments.  The addition
   of ECN-capability to SYN/ACK packets could be of significant benefit
   for those ECN connections that would have had the SYN/ACK packet
   dropped in the network, and for which the ECN-Capability would allow
   the SYN/ACK to be marked rather than dropped.

   The percent of SYN/ACK packets on a link can be quite high. In
   particular, measurements on links dominated by web traffic indicate
   that 15-20% of the packets can be SYN/ACK packets [SCJO01].

   The benefit of adding ECN-capability to SYN/ACK packets depends in
   part on the size of the data transfer.  The drop of a SYN/ACK packet
   can increase the download time of a short file by an order of
   magnitude, by requiring a three-second retransmit timeout.  For
   longer-lived flows, the effect of a dropped SYN/ACK packet on file
   download time is less dramatic.  However, even for longer-lived
   flows, the addition of ECN-capability to SYN/ACK packets can improve
   the fairness among long-lived flows, as newly-arriving flows would be
   less likely to have to wait for retransmit timeouts.

   One question that arises is what fraction of connections would see
   the benefit from making SYN/ACK packets ECN-capable, in a particular
   scenario.  Specifically:

   (1) What fraction of arriving SYN/ACK packets are dropped at the
   congested router when the SYN/ACK packets are not ECN-capable?

   (2) Of those SYN/ACK packets that are dropped, what fraction would
   have been ECN-marked instead of dropped if the SYN/ACK packets had
   been ECN-capable?

   To answer (1), it is necessary to consider not only the level of
   congestion but also the queue architecture at the congested link.  As
   described in Section 4 above, for some queue architectures small
   packets are less likely to be dropped than large ones.  In such an



Floyd et al.            Expires: 22 February 2009              [Page 14]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   environment, SYN/ACK packets would have lower packet drop rates;
   question (1) could not necessarily be inferred from the overall
   packet drop rate, but could be answered by measuring the drop rate
   for SYN/ACK packets directly.  In such an environment, adding ECN-
   capability to SYN/ACK packets would be of less dramatic benefit than
   in environments where all packets are equally likely to be dropped
   regardless of packet size.

   As question (2) implies, even if all of the SYN/ACK packets were ECN-
   capable, there could still be some SYN/ACK packets dropped instead of
   marked at the congested link; the full answer to question (2) depends
   on the details of the queue management mechanism at the router.  If
   congestion is sufficiently bad, and the queue management mechanism
   cannot prevent the buffer from overflowing, then SYN/ACK packets will
   be dropped rather than marked upon buffer overflow whether or not
   they are ECN-capable.

   For some AQM mechanisms, ECN-capable packets are marked instead of
   dropped any time this is possible, that is, any time the buffer is
   not yet full.  For other AQM mechanisms however, such as the RED
   mechanism as recommended in [RED], packets are dropped rather than
   marked when the packet drop/mark rate exceeds a certain threshold,
   e.g., 10%, even if the packets are ECN-capable.  For a router with
   such an AQM mechanism, when congestion is sufficiently severe to
   cause a high drop/mark rate, some SYN/ACK packets would be dropped
   instead of marked whether or not they were ECN-capable.

   Thus, the degree of benefit of adding ECN-Capability to SYN/ACK
   packets depends not only on the overall packet drop rate in the
   network, but also on the queue management architecture at the
   congested link.


6.2.  An Evaluation of Different Responses to ECN-Marked SYN/ACK Packets

   This document specifies that the end-node responds to the report of
   an ECN-marked SYN/ACK packet by setting the initial congestion window
   to one segment, instead of its possible default value of two to four
   segments.  We call this ECN+ with NoWaiting.  However, Section 4
   discussed another possible response to an ECN-marked SYN/ACK packet,
   of the end-node waiting an RTT before sending a data packet.  We call
   this approach ECN+ with Waiting.

   Simulations comparing the performance with Standard ECN (without ECN-
   marked SYN/ACK packets), ECN+ with NoWaiting, and ECN+ with Waiting
   show little difference, in terms of aggregate congestion, between
   ECN+ with NoWaiting and ECN+ with Waiting.  The details are given in
   Appendix A below.  Our conclusions are that ECN+ with NoWaiting is



Floyd et al.            Expires: 22 February 2009              [Page 15]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   perfectly safe, and there are no congestion-related reasons for
   preferring ECN+ with Waiting over ECN+ with NoWaiting.  That is,
   there is no need for the TCP end-node to wait a round-trip time
   before sending a data packet after receiving an acknowledgement of an
   ECN-marked SYN/ACK packet.


7.  Security Considerations

   TCP packets carrying the ECT codepoint in IP headers can be marked
   rather than dropped by ECN-capable routers. This raises several
   security concerns that we discuss below.


7.1.  'Bad' Routers or Middleboxes

   There are a number of known deployment problems from using ECN with
   TCP traffic in the Internet.  The first reported problem, dating back
   to 2000, is of a small but decreasing number of routers or
   middleboxes that reset a TCP connection in response to TCP SYN
   packets using flags in the TCP header to negotiate ECN-capability
   [Kelson00] [RFC3360] [MAF05].  Dave Thaler reported at the March 2007
   IETF of new two problems encountered by TCP connections using ECN;
   the first of the two problems concerns routers that crash when a TCP
   data packet arrives with the ECN field in the IP header with the
   codepoint ECT(0) or ECT(1), indicating that an ECN-Capable connection
   has been established [SBT07].

   While there is no evidence that any routers or middleboxes drop
   SYN/ACK packets that contain an ECN-Capable or CE codepoint in the IP
   header, such behavior cannot be excluded.  (There seems to be a
   number of routers or middleboxes that drop TCP SYN packets that
   contain known or unknown IP options [MAF05] (Figure 1).)  Thus, as
   specified in Section 3, if a SYN/ACK packet with the ECT or CE
   codepoint is dropped, the TCP node SHOULD resend the SYN/ACK packet
   without the ECN-Capable codepoint.  There is also no evidence that
   any routers or middleboxes crash when a SYN/ACK arrives with an ECN-
   Capable or CE codepoint in the IP header (over and above the routers
   already known to crash when a data packet arrives with either ECT(0)
   or ECT(1)), but we have not conducted any measurement studies of this
   [F07].


7.2.  Congestion Collapse

   Because TCP SYN/ACK packets carrying an ECT codepoint could be ECN-
   marked instead of dropped at an ECN-capable router, the concern is
   whether this can either invoke congestion, or worsen performance in



Floyd et al.            Expires: 22 February 2009              [Page 16]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   highly congested scenarios.  However, after learning that a SYN/ACK
   packet was ECN-marked, the responder will only send one data packet;
   if this data packet is ECN-marked, the responder will then wait for a
   retransmission timeout.  In addition, routers are free to drop rather
   than mark arriving packets in times of high congestion, regardless of
   whether the packets are ECN-capable.  When congestion is very high
   and a router's buffer is full, the router has no choice but to drop
   rather than to mark an arriving packet.

   The simulations reported in Appendix A show that even with demanding
   traffic mixes dominated by short flows and high levels of congestion,
   the aggregate packet dropping rates are not significantly different
   with Standard ECN, ECN+ with NoWaiting, or ECN+ with Waiting.  In
   particular, the simulations show that in periods of very high
   congestion the packet-marking rate is low with or without ECN+, and
   the use of ECN+ does not significantly increase the number of dropped
   or marked packets.

   The simulations show that ECN+ is most effective in times of moderate
   congestion.  In these moderate-congested scenarios, the use of ECN+
   increases the number of ECN-marked packets, because ECN+ allows
   SYN/ACK packets to be ECN-marked.  At the same time, in these times
   of moderate congestion, the use of ECN+ instead of Standard ECN does
   not significantly affect the overall levels of congestion.

   The simulations show that the use of ECN+ is less effective in times
   of high congestion;  the simulations show that in times of high
   congestion more packets are dropped instead of marked, both with
   Standard ECN and with ECN+.  In times of high congestion, the buffer
   can overflow, even with Active Queue Management and ECN; when the
   buffer is full arriving packets are dropped rather than marked,
   whether the packets are ECN-capable or not.  Thus while ECN+ is less
   effective in times of high congestion, it still doesn't result in a
   significant increase in the level of congestion.  More details are
   given in the appendix.

8.  Conclusions

   This draft specifies a modification to RFC 3168 to allow TCP nodes to
   send SYN/ACK packets as being ECN-Capable.  Making the SYN/ACK packet
   ECN-Capable avoids the high cost to a TCP transfer when a SYN/ACK
   packet is dropped by a congested router, by avoiding the resulting
   retransmit timeout.  This improves the throughput of short
   connections.  The sender of the SYN/ACK packet responds to an ECN
   mark by reducing its initial congestion window from two, three, or
   four segments to one segment, reducing the subsequent load from that
   connection on the network.  The addition of ECN-capability to SYN/ACK
   packets is particularly beneficial in the server-to-client direction,



Floyd et al.            Expires: 22 February 2009              [Page 17]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   where congestion is more likely to occur.  In this case, the initial
   information provided by the ECN marking in the SYN/ACK packet enables
   the server to more appropriately adjust the initial load it places on
   the network.

9.  Acknowledgements

   We thank Anil Agarwal, Mark Allman, Remi Denis-Courmont, Wesley Eddy,
   Lars Eggert, Alfred Hoenes, Janardhan Iyengar, and Pasi Sarolahti for
   feedback on earlier versions of this draft.

A.  Report on Simulations

   This section reports on simulations showing the costs of adding ECN+
   in highly-congested scenarios.  This section also reports on
   simulations for a comparative evaluation between ECN+ with NoWaiting
   and ECN+ with Waiting.

   The simulations are run with a range of file-size distributions,
   using the PackMime traffic generator in the ns-2 simulator.  They all
   use a heavy-tailed distribution of file sizes.  The simulations
   reported in the tables below use a mean file size of 3 KBypes, to
   show the results with a traffic mix with a large number of small
   transfers.  Othe simulations were run with mean file sizes of 5
   KBytes, 7 Kbytes, 14 KBytes, and 17 Kbytes.  The title of each chart
   gives the targeted average load from the traffic generator.  Because
   the simulations use a heavy-tailed distribution of file sizes, and
   run for only 85 seconds (including ten seconds of warm-up time), the
   actual load is often much smaller than the targeted load.  The
   congested link is 100 Mbps.  RED is run in gentle mode, and arriving
   ECN-Capable packets are only dropped instead of marked if the buffer
   is full (and the router has no choice).

   We explore two alternatives for a TCP node's response to a report of
   an ECN-marked SYN/ACK packet.  With ECN+ with NoWaiting, the TCP node
   sends a data packet immediately (with an initial congestion window of
   one segment).  With the alternative ECN+ with Waiting, the TCP node
   waits a round-trip time before sending a data packet; the responder
   already has one measurement of the round-trip time when the
   acknowledgement for the SYN/ACK packet is received.

   In the tables below, ECN+ refers to ECN+ with NoWaiting, where the
   responder starts transmitting immediately, and ECN+/wait refers to
   ECN+ with Waiting, where the responder waits a round-trip time before
   sending a data packet into the network.

   The simulation scripts are available on [ECN-SYN].




Floyd et al.            Expires: 22 February 2009              [Page 18]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


A.1.  Simulations with RED in Packet Mode

   The simulations with RED in packet mode and with the queue in packets
   show that ECN+ is useful in times of moderate congestion, though it
   adds little benefit in times of high congestion.  The simulations
   show a minimal increase in levels of congestion with either ECN+ with
   Waiting or ECN+ with NoWaiting, either in terms of packet dropping or
   marking rates or in terms of the distribution of responses times.
   Thus, the simulations show no problems with ECN+ in times of high
   congestion, and no reason to use ECN+ with Waiting instead of ECN+
   with NoWaiting.

   Table 1 shows the congestion levels for simulations with RED in
   packet mode, with a queue in packets.  To explore a worst-case
   scenario, these simulations use a traffic mix with an unrealistically
   small flow size distribution, with a mean flow size of 3 Kbytes.  For
   each table showing a particular traffic load, the three rows show the
   number of packets dropped, the number of packets ECN-marked, and the
   aggregate packet drop rate, and the three columns show the
   simulations with Standard ECN, ECN+ (NoWaiting) and ECN+/wait.

   These simulations were run with RED set to mark instead of drop
   packets any time that the queue is not full.  For the default
   implementation of RED in the ns-2 simulator, the router drops instead
   of marks arriving packets when the average queue size exceeds a
   configured threshold.

   The usefulness of ECN+: The first thing to observe is that for all of
   the simulations, the use of ECN+ or ECN+/wait significantly increased
   the number of packets marked.  This indicates that with ECN+ or
   ECN+/wait, many SYN/ACK packets are marked instead of dropped.

   Little increase in congestion, sometimes: The second thing to observe
   is that for the simulations with low or moderate levels of congestion
   (that is, with packet drop rates less than 10%), the use of ECN+ or
   ECN+/wait decreases the aggregate packet drop rate, relative to the
   simulations with ECN.  This makes sense, since with low or moderate
   levels of congestion, ECN+ allows SYN/ACK packets to be marked
   instead of dropped, and the use of ECN+ doesn't add to the aggregate
   congestion.  However, for the simulations with packet drop rates of
   15% or higher with ECN, the use of ECN+ or ECN+/wait increases the
   aggregate packet drop rate, sometimes even doubling it.

   Comparing ECN+ and ECN+/wait: The third thing to observe is that the
   aggregate packet drop rate is generally higher with ECN+/wait than
   with ECN+.  Thus, there is no congestion-related reason to prefer
   ECN+/wait over ECN+.




Floyd et al.            Expires: 22 February 2009              [Page 19]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


        Target Load = 95%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped     18,512      11,244      12,135
        Marked      27,026      36,977      38,743
        Loss rate    1.27%       0.78%       0.84%
        Throughput     81%         81%         81%


        Target Load = 110%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped    165,866     110,525     144,821
        Marked     180,714     290,629     311,233
        Loss rate    9.04%       6.36%       7.94%
        Throughput     92%         92%         92%


        Target Load = 125%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped    574,114   1,764,677   2,229,280
        Marked     409,441   1,172,550   1,181,209
        Loss rate   24.55%      52.00%      57.64%
        Throughput     94%         98%         97%

   Table 1: Simulations with an average flow size of 3 Kbytes, a
   100 Mbps link, RED in packet mode, queue in packets.























Floyd et al.            Expires: 22 February 2009              [Page 20]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


        Target Load = 95%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped      8,754       6,719       7,269
        Marked      10,376      17,637      16,956
        Loss rate    5.68%       4.50%       4.75%
        Throughput     78%         78%         78%


        Target Load = 110%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped     32,110      32,014      48,838
        Marked      28,476      56,550      62,252
        Loss rate   15.68%      16.11%      21.92%
        Throughput     96%         96%         96%


        Target Load = 125%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped     60,710     174,920     215,001
        Marked      43,497     119,620     118,172
        Loss rate   25.08%      51.59%      56.27%
        Throughput     98%         98%         98%

        Target Load = 150%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped    133,128     250,762     327,584
        Marked      63,306     146,581     147,307
        Loss rate   43.34%      61.11%      67.33%
        Throughput     93%        100%        100%

   Table 2: Simulations with an average flow size of 3 Kbytes, a 10 Mbps
   link, RED in packet mode, queue in packets.

A.2.  Simulations with RED in Byte Mode

   Table 3 below shows simulations with RED in byte mode and the queue
   in bytes.  There is no significant increase in aggregate congestion
   with the use of ECN+ or ECN+/wait, and no congestion-related reason
   to prefer ECN+/wait over ECN+.

   However, unlike the simulations with RED in packet mode, the
   simulations with RED in byte mode show little benefit from the use of
   ECN+ or ECN+/wait, in that the packet marking rate with ECN+ or
   ECN+/wait is not much different than the packet marking rate with



Floyd et al.            Expires: 22 February 2009              [Page 21]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   Standard ECN.  This is because with RED in byte mode, small packets
   like SYN/ACK packets are rarely dropped or marked - that is, there is
   no drawback from the use of ECN+ in these scenarios, but not much
   need for ECN+ either, in a scenario where small packets are unlikely
   to be dropped or marked.


        Target Load = 95%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped        739        438         442
        Marked      32,405      34,357     34,000
        Loss rate    0.05%       0.03%      0.03%
        Throughput     81%         81%        81%

        Target Load = 110%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped      2,473       1,679       3,020
        Marked     226,971     222,234     327,608
        Loss rate    0.15%       0.10%       0.18%
        Throughput     92%         92%         91%

        Target Load = 125%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped     19,358      14,057       14,064
        Marked     717,123     728,513      729,001
        Loss rate    1.07%       0.78%        0.78%
        Throughput     95%         95%          95%

   Table 3: Simulations with an average flow size of 3 Kbytes, a
   100 Mbps link, RED in byte mode, queue in bytes.


















Floyd et al.            Expires: 22 February 2009              [Page 22]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


        Target Load = 95%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped        142          81          78
        Marked      11,694      11,812      11,964
        Loss rate    0.01%        0.06%      0.05%
        Throughput     78%         78%        78%

        Target Load = 110%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped        314         215         188
        Marked      39,697      42,388      40,229
        Loss rate    0.19%       0.13%       0.11%
        Throughput     95%         94%         95%

        Target Load = 125%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped      1,599       1,011         985
        Marked      74,567      75,782      75,528
        Loss rate    0.87%       0.56%       0.54%
        Throughput     98%         98%         98%

        Target Load = 150%:
                      ECN        ECN+     ECN+/wait
                   -------     -------     -------
        Dropped      2,429       1,538       1,571
        Marked      85,312      86,481      86,476
        Loss rate    1.22%       0.78%       0.79%
        Throughput     98%         98%         98%

   Table 4: Simulations with an average flow size of 3 Kbytes, a 10 Mbps
   link, RED in byte mode, queue in bytes.

B.  Issues of Incremental Deployment

   In order for TCP node B to send a SYN/ACK packet as ECN-Capable, node
   B must have received an ECN-setup SYN packet from node A.  However,
   it is possible that node A supports ECN, but either ignores the CE
   codepoint on received SYN/ACK packets, or ignores SYN/ACK packets
   with the ECT or CE codepoint set.  If the TCP initiator ignores the
   CE codepoint on received SYN/ACK packets, this would mean that the
   TCP responder would not respond to this congestion indication.
   However, this seems to us an acceptable cost to pay in the
   incremental deployment of ECN-Capability for TCP's SYN/ACK packets.
   It would mean that the responder would not reduce the initial
   congestion window from two, three, or four segments down to one



Floyd et al.            Expires: 22 February 2009              [Page 23]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   segment, as it should.  However, the TCP end nodes would still
   respond correctly to any subsequent CE indications on data packets
   later on in the connection.

   Figure 3 shows an interchange with the SYN/ACK packet ECN-marked, but
   with the ECN mark ignored by the TCP originator.

        ---------------------------------------------------------------
           TCP Node A             Router                  TCP Node B
           ----------             ------                  ----------

           ECN-setup SYN packet --->
                                           ECN-setup SYN packet --->

                                         <--- ECN-setup SYN/ACK, ECT
                              <--- Sets CE on SYN/ACK
           <--- ECN-setup SYN/ACK, CE

           Data/ACK, No ECN-Echo --->
                                                      Data/ACK --->
                                     <--- Data (up to four packets)
        ---------------------------------------------------------------

           Figure 3: SYN exchange with the SYN/ACK packet marked,
             but with the ECN mark ignored by the TCP initiator.

   Thus, to be explicit, when a TCP connection includes an initiator
   that supports ECN but *does not* support ECN-Capability for SYN/ACK
   packets, in combination with a responder that *does* support ECN-
   Capability for SYN/ACK packets, it is possible that the ECN-Capable
   SYN/ACK packets will be marked rather than dropped in the network,
   and that the responder will not learn about the ECN mark on the
   SYN/ACK packet.  This would not be a problem if most packets from the
   responder supporting ECN for SYN/ACK packets were in long-lived TCP
   connections, but it would be more problematic if most of the packets
   were from TCP connections consisting of four data packets, and the
   TCP responder for these connections was ready to send its data
   packets immediately after the SYN/ACK exchange.  Of course, with
   *severe* congestion, the SYN/ACK packets would likely be dropped
   rather than ECN-marked at the congested router, preventing the TCP
   responder from adding to the congestion by sending its initial window
   of four data packets.

   It is also possible that in some older TCP implementation, the
   initiator would ignore arriving SYN/ACK packets that had the ECT or
   CE codepoint set.  This would result in a delay in connection set-up
   for that TCP connection, with the initiator re-sending the SYN packet
   after a retransmit timeout.  We are not aware of any TCP



Floyd et al.            Expires: 22 February 2009              [Page 24]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   implementations with this behavior.

   One possibility for coping with problems of backwards compatibility
   would be for TCP initiators to use a TCP flag that means "I
   understand ECN-Capable SYN/ACK packets".  If this document were to
   standardize the use of such an "ECN-SYN" flag, then the TCP responder
   would only send a SYN/ACK packet as ECN-capable if the incoming SYN
   packet had the "ECN-SYN" flag set.  An ECN-SYN flag would prevent the
   backwards compatibility problems described in the paragraphs above.

   One drawback to the use of an ECN-SYN flag is that it would use one
   of the four remaining reserved bits in the TCP header, for a
   transient backwards compatibility problem.  This drawback is limited
   by the fact that the "ECN-SYN" flag would be defined only for use
   with ECN-setup SYN packets;  that bit in the TCP header could be
   defined to have other uses for other kinds of TCP packets.

   Factors in deciding not to use an ECN-SYN flag include the following:

   (1) The limited installed base: At the time that this document was
   written, the TCP implementations in Microsoft Vista and Mac OS X
   included ECN, but ECN was not enabled by default [SBT07].  Thus,
   there was not a large deployed base of ECN-Capable TCP
   implementations.  This limits the scope of any backwards
   compatibility problems.

   (2) Limits to the scope of the problem: The backwards compatibility
   problem would not be serious enough to cause congestion collapse;
   with severe congestion, the buffer at the congested router will
   overflow, and the congested router will drop rather than ECN-mark
   arriving SYN packets.  Some active queue management mechanisms might
   switch from packet-marking to packet-dropping in times of high
   congestion before buffer overflow, as recommended in Section 19.1 of
   RFC 3168.  This helps to prevent congestion collapse problems with
   the use of ECN.

   (3) Detection of and response to backwards-compatibility problems: A
   TCP responder such as a web server can't differentiate between a
   SYN/ACK packet that is not ECN-marked in the network, and a SYN/ACK
   packet that is ECN-marked, but where the ECN mark is ignored by the
   TCP initiator.  However, a TCP responder *can* detect if a SYN/ACK
   packet is sent as ECN-capable and not reported as ECN-marked, but
   data packets are dropped or marked from the initial window of data.
   We will call this scenario "initial-window-congestion".  If a web
   server frequently experienced initial-window congestion (without
   SYN/ACK congestion), then the web server *might* be experiencing
   backwards compatibility problems with ECN-Capable SYN/ACK packets,
   and could respond by not sending SYN/ACK packets as ECN-Capable.



Floyd et al.            Expires: 22 February 2009              [Page 25]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


Normative References

   [RFC 2119] S. Bradner, Key words for use in RFCs to Indicate
   Requirement Levels, RFC 2119, March 1997.

   [RFC3168] K.K. Ramakrishnan, S. Floyd, and D. Black, The Addition of
   Explicit Congestion Notification (ECN) to IP, RFC 3168, Proposed
   Standard, September 2001.

Informative References

   [ECN+] A. Kuzmanovic, The Power of Explicit Congestion Notification,
   SIGCOMM 2005.

   [ECN-SYN] ECN-SYN web page with simulation scripts, URL
   "http://www.icir.org/floyd/ecn-syn".

   [F07] S. Floyd, "[BEHAVE] Response of firewalls and middleboxes to
   TCP SYN packets that are ECN-Capable?", August 2, 2007, email sent to
   the BEHAVE mailing list, URL "http://www1.ietf.org/mail-
   archive/web/behave/current/msg02644.html".

   [Kelson00] Dax Kelson, note sent to the Linux kernel mailing list,
   September 10, 2000.

   [MAF05] A. Medina, M. Allman, and S. Floyd.  Measuring the Evolution
   of Transport Protocols in the Internet, ACM CCR, April 2005.

   [PI] C. Hollot, V. Misra, W. Gong, and D. Towsley, On Designing
   Improved Controllers for AQM Routers Supporting TCP Flows, April
   1998.

   [RED] Floyd, S., and Jacobson, V.  Random Early Detection gateways
   for Congestion Avoidance .  IEEE/ACM Transactions on Networking, V.1
   N.4, August 1993.

   [REM] S. Athuraliya, V. H. Li, S. H. Low and Q. Yin, REM: Active
   Queue Management, IEEE Network, May 2001.

   [RFC2309] B. Braden et al., Recommendations on Queue Management and
   Congestion Avoidance in the Internet, RFC 2309, April 1998.

   [RFC2581] M. Allman, V. Paxson, and W. Stevens, TCP Congestion
   Control, RFC 2581, April 1999.

   [RFC2988] V. Paxson and M. Allman, Computing TCP's Retransmission
   Timer, RFC 2988, November 2000.




Floyd et al.            Expires: 22 February 2009              [Page 26]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   [RFC3042] M. Allman, H. Balakrishnan, and S. Floyd, Enhancing TCP's
   Loss Recovery Using Limited Transmit, RFC 3042, Proposed Standard,
   January 2001.

   [RFC3360] S. Floyd, Inappropriate TCP Resets Considered Harmful, RFC
   3360, August 2002.

   [RFC3390] M. Allman, S. Floyd, and C. Partridge, Increasing TCP's
   Initial Window, RFC 3390, October 2002.

   [RFC4987] W. Eddy, TCP SYN Flooding Attacks and Common Mitigations,
   RFC 4987, August 2007.

   [SCJO01] F. Smith, F. Campos, K. Jeffay, and D. Ott, What TCP/IP
   Protocol Headers Can Tell us about the Web, SIGMETRICS, June 2001.

   [SYN-COOK]   Dan J. Bernstein, SYN cookies, 1997, see also
   <http://cr.yp.to/syncookies.html>

   [SBT07] M. Sridharan, D. Bansal, and D. Thaler, Implementation Report
   on Experiences with Various TCP RFCs, Presentation in the TSVAREA,
   IETF 68, March 2007.  URL
   "http://www3.ietf.org/proceedings/07mar/slides/tsvarea-3/sld6.htm".

   [Tools] S. Floyd and E. Kohler, Tools for the Evaluation of
   Simulation and Testbed Scenarios, Internet-draft draft-irtf-tmrg-
   tools-05, work in progress, February 2008.

IANA Considerations

   There are no IANA considerations regarding this document.


Authors' Addresses

















Floyd et al.            Expires: 22 February 2009              [Page 27]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   Aleksandar Kuzmanovic
   Phone: +1 (847) 467-5519
   Northwestern University
   Email: akuzma at northwestern.edu
   URL: http://cs.northwestern.edu/~a

   Amit Mondal
   Northwestern University
   Email: a-mondal at northwestern.edu

   Sally Floyd
   Phone: +1 (510) 666-2989
   ICIR (ICSI Center for Internet Research)
   Email: floyd@icir.org
   URL: http://www.icir.org/floyd/

   K. K. Ramakrishnan
   Phone: +1 (973) 360-8764
   AT&T Labs Research
   Email: kkrama at research.att.com
   URL: http://www.research.att.com/info/kkrama


Full Copyright Statement

   Copyright (C) The IETF Trust (2008).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.

Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be



Floyd et al.            Expires: 22 February 2009              [Page 28]

INTERNET-DRAFT           ECN and SYN/ACK Packets             August 2008


   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at ietf-
   ipr@ietf.org.





































Floyd et al.            Expires: 22 February 2009              [Page 29]
